import {
	AboutUsCommentType,
	CourseCardType,
	DropDownMenuItemsType,
	ProjectCardType,
	TeacherCardType,
} from "@/types/card";
import profile from "../../public/profial.png";
import teacherProfile from "../../public/teacher.png";

export const projects: ProjectCardType[] = [
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
	{
		createDate: "1 ساعت پیش",
		priceRange: "بودجه از 5.000.000 تا 10.000.000 تومان",
		title: "طراحی رابط کاربری سایت مواد غذایی",
		description:
			"	لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با ...",
	},
];

export const aboutUsComments: AboutUsCommentType[] = [
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "محسن عبدالهی",
		profile,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با",
	},
];

export const teachers: TeacherCardType[] = [
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
	{
		fullName: "مصطفی غلامی",
		profile: teacherProfile,
		role: "طراح گرافیک",
		star: 4.5,
		description:
			"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی موردنیاز، و کاربردهای متنوع با",
	},
];

export const courses: CourseCardType[] = [
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
	{
		courseDuration: 36,
		price: "300.000",
		profile: teacherProfile,
		reshte: "موسیقی",
		star: 4.5,
		studentCount: 12,
		teacherName: "سعید سعادتی فر",
		title: "عنوان دوره",
	},
];

export const dropDownMenuItems: DropDownMenuItemsType = {
	"کسب و کار": [
		"برنامه نویسی",
		"آمار و داده کاوی",
		"مهندسی مکانیک",
		"پایتون",
		"بورس و سهام",
		"هنر",
		"ریاضیات",
		"هوش مصنوعی",
		"اکسل",
		"مهندسی برق",
		"مهندسی نرم افزار",
		"طراحی گرافیک",
		"مهندسی عمران",
		"مهندسی معماری",
		"زبان انگلیسی",
		"مهندسی صنایع",
	],

	دبستان: [
		"اول ابتدایی",
		"دوم ابتدایی",
		"سوم ابتدایی",
		"چهارم ابتدایی",
		"پنجم ابتدایی",
		"ششم ابتدایی",
		"تیزهوشان",
	],

	"متوسطه اول": ["هفتم", "هشتم", "نهم", "تیزهوشان"],

	"متوسطه دوم": ["دهم", "یازدهم", "دوازدهم"],

	کنکور: ["دهم", "یازدهم", "دوازدهم"],

	دانشگاه: [
		"ریاضی 1",
		"ریاضی 2",
		"معادلات دیفرانسیل",
		"ریاضیات مهندسی",
		"ترمودینامیک",
		"فیزیک",
		"استاتیک",
		"دینامیک",
		"شیمی",
		"برق",
		"خواص بیولوژی",
		"میکرو بیولوژی",
		"مهندسی عمران",
		"مهندسی معماری",
		"زبان انگلیسی",
		"مهندسی صنایع",
	],
};
